tinyNozzle/2D/6_with2outlets_cyclic_short_3.27Exit_30Deg(CURRENT 30 DEG)/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1000;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           uniform 1000;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }


    wall
    {
        type            kqRWallFunction;
        value           uniform 1000;
    }

    front
    {
	type		wedge;
    }
    back
    {
        type            wedge;
    }
    
}
// ************************************************************************* //
